// Tactic: Hunting Utility
// Technique: N/A
// Severity: Low
// Description: Baseline query for uncommon parent-child process pairs.

DeviceProcessEvents
| where Timestamp > ago(14d)
| summarize Count=count(), Devices=dcount(DeviceName)
  by InitiatingProcessFileName, FileName
| where Count < 5 and Devices <= 2
| order by Count asc
